"""
Завдання: Бінарний пошук у відсортованому списку

Мета:
    Освіжити знання про:
    - роботу з індексами та зрізами;
    - ітеративні алгоритми;
    - контроль потоку виконання (if / elif / else);
    - мислення в термінах "звуження простору пошуку".

Умова:
    Реалізуйте функцію бінарного пошуку, яка шукає заданий елемент у відсортованому списку цілих чисел.

    Функція повинна повертати:
    - індекс елемента, якщо він знайдений;
    - -1, якщо елемент відсутній у списку.

Вимоги:
    - список гарантовано відсортований за зростанням;
    - реалізація має бути ітеративною (без рекурсії);
    - використовуйте if / elif / else для обробки умов;
    - функція не повинна нічого друкувати.

Приклад:
    >>> binary_search([2, 5, 7, 9, 11, 17, 222], 11)
    4

    >>> binary_search([2, 5, 7, 9, 11, 17, 222], 12)
    -1

Аналітична частина:
    У докстрінгу функції додай відповіді на питання (коротко):
    1. Яка часова складність алгоритму за Big-O нотацією? І чому?
    2. Яка просторова складність за Big-O нотацією? І чому?
"""


def binary_search(data: list[int], target: int) -> int:
    """
    1. O(log n), each iteration we divide the search
    2. O(1), use only constants
    """
    good = -1
    bad = len(data)

    while bad - good > 1:
        mid = (good + bad) // 2
        if data[mid] > target:
            bad = mid
        elif data[mid] < target:
            good = mid
        else:
            return mid

    return -1
